#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details open><summary>Terraform Plan</summary>

```

data.aws_route53_zone.ecs_domain: Reading...
module.ecr.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.ecs.module.cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/atlas-cluster]
aws_secretsmanager_secret.backend_secrets: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:757082729759:secret:atlas-backend-P7JPQE]
module.ecr.data.aws_partition.current: Reading...
data.aws_region.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03289f94e18646154]
module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:757082729759:certificate/5f558056-e6e3-4f7a-9685-b06f0e30bc0a]
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_availability_zones.available: Reading...
module.alb.data.aws_partition.current[0]: Reading...
module.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=atlas]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=757082729759]
module.ecr.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=996006171]
data.aws_caller_identity.current: Read complete after 0s [id=757082729759]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_secretsmanager_secret_version.backend_secrets: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:757082729759:secret:atlas-backend-P7JPQE|terraform-20251119182801304900000001]
module.ecs.module.cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:757082729759:cluster/atlas-cluster]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=atlas]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=atlas]
module.ecs.module.cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=atlas-cluster]
data.aws_route53_zone.ecs_domain: Read complete after 1s [id=Z07137001EGM5VZYG83X8]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z07137001EGM5VZYG83X8__f5dcc02929533cc50697c7e364e7d847.atlas-assistant.ds.io._CNAME]
module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2025-11-12 01:52:16.236 +0000 UTC]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-08051020ab6126f0f]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0dcfcded61b9fbc9e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02c1aab179c651a5e]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-07795e64001b6db0f]
module.alb.aws_lb_target_group.this["ecs_tg"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:757082729759:targetgroup/tf-20251119050939812400000001/0a68004d0926b7e1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0a2558310700565e6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e64bac2aee4ce75b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ab6e527cf89a9de4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09c3b628017e267cf]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac9eb4080bd25c0e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0816c99f59d729149]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-04225e3ac37eb8717]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f243362d7c8bbce0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ee28703cd3d25b43]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01c425311cd3f1196]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-003bc45a8af642617]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0ff162ba4fcef51d5]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-07d0fed2c4f085987]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e64bac2aee4ce75b1080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-050a0e163ca98e4f3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04ddbcc18760a8f53]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f13cc9d613a9452b]
module.ecs.module.service["atlas-backend"].data.aws_partition.current[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_caller_identity.current[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.ecs.module.service["atlas-backend"].data.aws_region.current[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.ecs.module.service["atlas-backend"].data.aws_subnet.this[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.tasks[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.tasks[0]: Read complete after 0s [id=757765849]
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-04a32bdc90c40388d]
module.ecs.module.service["atlas-backend"].aws_iam_policy.tasks[0]: Refreshing state... [id=arn:aws:iam::757082729759:policy/atlas-backend-tasks-20251116234105401000000004]
module.ecs.module.service["atlas-backend"].data.aws_caller_identity.current[0]: Read complete after 0s [id=757082729759]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a2465ff114318352]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0ff904d7ad05b62b3]
module.ecs.module.service["atlas-backend"].module.container_definition["api"].data.aws_region.current: Reading...
module.ecs.module.service["atlas-backend"].module.container_definition["api"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=199952894]
module.ecs.module.service["atlas-backend"].aws_iam_role.task_exec[0]: Refreshing state... [id=atlas-backend-taskexec-20251116234104652600000002]
module.ecs.module.service["atlas-backend"].aws_iam_policy.task_exec[0]: Refreshing state... [id=arn:aws:iam::757082729759:policy/atlas-backend-taskexec-20251116234104652600000001]
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs.module.service["atlas-backend"].data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=4216913783]
module.ecs.module.service["atlas-backend"].data.aws_subnet.this[0]: Read complete after 0s [id=subnet-0ab6e527cf89a9de4]
module.ecs.module.service["atlas-backend"].module.container_definition["api"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/atlas-backend/api]
module.ecs.module.service["atlas-backend"].aws_iam_role.tasks[0]: Refreshing state... [id=atlas-backend-tasks-20251116234105073100000003]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:757082729759:loadbalancer/app/atlas-lb/4483a88acd924120]
module.ecs.module.service["atlas-backend"].aws_security_group.this[0]: Refreshing state... [id=sg-0724bfcc4ba152baf]
module.ecs.module.service["atlas-backend"].aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-07df038ccf9ef8105]
module.ecs.module.service["atlas-backend"].aws_vpc_security_group_ingress_rule.this["ecs_alb"]: Refreshing state... [id=sgr-02bceb7b9f7314e0e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0256afcefe6e79339]
module.ecs.module.service["atlas-backend"].aws_iam_role_policy_attachment.task_exec[0]: Refreshing state... [id=atlas-backend-taskexec-20251116234104652600000002/arn:aws:iam::757082729759:policy/atlas-backend-taskexec-20251116234104652600000001]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ee28703cd3d25b431080289494]
module.alb.aws_route53_record.this["A"]: Refreshing state... [id=Z07137001EGM5VZYG83X8_api_A]
module.alb.aws_lb_listener.this["ecs-https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:757082729759:listener/app/atlas-lb/4483a88acd924120/22ed82e682205229]
module.alb.aws_lb_listener.this["ecs-http-https-redirect"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:757082729759:listener/app/atlas-lb/4483a88acd924120/826137068bbdafb6]
module.ecs.module.service["atlas-backend"].aws_iam_role_policy_attachment.tasks_internal[0]: Refreshing state... [id=atlas-backend-tasks-20251116234105073100000003/arn:aws:iam::757082729759:policy/atlas-backend-tasks-20251116234105401000000004]
module.ecs.module.service["atlas-backend"].aws_ecs_task_definition.this[0]: Refreshing state... [id=atlas-backend]
module.ecs.module.service["atlas-backend"].aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:757082729759:service/atlas-cluster/atlas-backend]
module.ecs.module.service["atlas-backend"].aws_appautoscaling_target.this[0]: Refreshing state... [id=service/atlas-cluster/atlas-backend]
module.ecs.module.service["atlas-backend"].aws_appautoscaling_policy.this["memory"]: Refreshing state... [id=memory]
module.ecs.module.service["atlas-backend"].aws_appautoscaling_policy.this["cpu"]: Refreshing state... [id=cpu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cognito_managed_login_branding.client will be created
  + resource "aws_cognito_managed_login_branding" "client" {
      + client_id                   = (known after apply)
      + managed_login_branding_id   = (known after apply)
      + region                      = "us-east-1"
      + settings_all                = (known after apply)
      + use_cognito_provided_values = true
      + user_pool_id                = (known after apply)
    }

  # aws_cognito_user_pool.atlas_pool will be created
  + resource "aws_cognito_user_pool" "atlas_pool" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "ACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "ON"
      + name                       = "atlas-backend"
      + region                     = "us-east-1"
      + sms_verification_message   = (known after apply)
      + tags_all                   = {
          + "client"  = "cgiar"
          + "owner"   = "orbaco"
          + "project" = "atlas-assistant"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
          + recovery_mechanism {
              + name     = "verified_phone_number"
              + priority = 2
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + email_sending_account = "DEVELOPER"
          + source_arn            = (known after apply)
        }

      + email_mfa_configuration {}

      + password_policy (known after apply)

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # aws_cognito_user_pool_client.atlas_pool_client will be created
  + resource "aws_cognito_user_pool_client" "atlas_pool_client" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "phone",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "https://adaptationatlas.github.io",
          + "https://api.atlas-assistant.ds.io/docs/oauth2-redirect",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "atlas-backend-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + region                                        = "us-east-1"
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # aws_cognito_user_pool_domain.default will be created
  + resource "aws_cognito_user_pool_domain" "default" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "adaptation-atlas"
      + id                              = (known after apply)
      + managed_login_version           = 2
      + region                          = "us-east-1"
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # aws_secretsmanager_secret_version.backend_secrets must be replaced
-/+ resource "aws_secretsmanager_secret_version" "backend_secrets" {
      ~ arn                      = "arn:aws:secretsmanager:us-east-1:757082729759:secret:atlas-backend-P7JPQE" -> (known after apply)
      ~ has_secret_string_wo     = true -> (known after apply)
      ~ id                       = "arn:aws:secretsmanager:us-east-1:757082729759:secret:atlas-backend-P7JPQE|terraform-20251119182801304900000001" -> (known after apply)
      ~ secret_string_wo_version = 3 -> 4 # forces replacement
      ~ version_id               = "terraform-20251119182801304900000001" -> (known after apply)
      ~ version_stages           = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_ses_email_identity.email_mfa will be created
  + resource "aws_ses_email_identity" "email_mfa" {
      + arn    = (known after apply)
      + email  = "ali@developmentseed.org"
      + id     = (known after apply)
      + region = "us-east-1"
    }

  # module.ecs.module.service["atlas-backend"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:us-east-1:757082729759:service/atlas-cluster/atlas-backend"
        name                               = "atlas-backend"
        tags                               = {
            "client"  = "cgiar"
            "owner"   = "orbaco"
            "project" = "atlas-assistant"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:757082729759:task-definition/atlas-backend:26" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.module.service["atlas-backend"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:us-east-1:757082729759:task-definition/atlas-backend:26" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:757082729759:task-definition/atlas-backend" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment            = []
                    name                   = "api"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 8000
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  ~ secrets                = [
                        # (3 unchanged elements hidden)
                        {
                            name      = "MISTRAL_API_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:757082729759:secret:atlas-backend-P7JPQE:MISTRAL_API_KEY::"
                        },
                      + {
                          + name      = "OAUTH_CLIENT_ID"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:757082729759:secret:atlas-backend-P7JPQE:OAUTH_CLIENT_ID::"
                        },
                      + {
                          + name      = "OIDC_URL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:757082729759:secret:atlas-backend-P7JPQE:OIDC_URL::"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (17 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "atlas-backend" -> (known after apply)
      ~ revision                 = 26 -> (known after apply)
        tags                     = {
            "client"  = "cgiar"
            "owner"   = "orbaco"
            "project" = "atlas-assistant"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 1 to change, 2 to destroy.

```

</details>

*Pusher: @aliziel, Action: `pull_request`, Working Directory: `/terraform/aws`, Workflow: `Terraform Workflow`*